src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/InformationRegisters/НастройкиПользователей/НастройкиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователей</name>
  <resources>
    <name>Значение</name>
    <comment>(Общ)</comment>
    <type>
      <types>Characteristic.ВидыНастроекПользователей</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <comment>(Общ)</comment>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>Продукция</name>
  </enumValues>
  <enumValues>
    <name>Полуфабрикат</name>
  </enumValues>
  <enumValues>
    <name>Сырье</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Enums/СпособыПополненияЗапасов/СпособыПополненияЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПополненияЗапасов</name>
  <enumValues>
    <name>Закупка</name>
  </enumValues>
  <enumValues>
    <name>Производство</name>
  </enumValues>
  <enumValues>
    <name>Оба</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Catalogs/Номенклатура/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Запрос списка - из модуля менеджера: тот же текст выполняет сценарий СписокНоменклатуры.
	Список.ТекстЗапроса = Справочники.Номенклатура.ТекстЗапросаСписка();
	УстановитьЗаголовок();
	НастроитьФильтры();
	ОтборСклад = РегистрыСведений.НастройкиПользователей.СкладПользователя();
	НастроитьФорму();
	ПрименитьОтборы();

КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	// Сохранённые фильтры панели восстановлены после ПриСозданииНаСервере - отбор строится заново.
	СброситьНедоступныеПозиции();
	ПрименитьОтборы();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина);
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "ScanData" И ВводДоступен() Тогда
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТовара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТовара <> Неопределено И ЗначениеЗаполнено(СтруктураТовара.Номенклатура) Тогда
			Элементы.Список.ТекущаяСтрока = СтруктураТовара.Номенклатура;
			ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", Новый Структура("Ключ", СтруктураТовара.Номенклатура));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтрПанелиПриИзменении(Элемент)

	ПрименитьОтборы();
	// Отбор мог оставить список пустым или сменить текущую строку - сведения перечитываются отложенно.
	СписокПриАктивизацииСтроки(Элементы.Список);

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	// Отложенно: при листании стрелками не дёргать сервер на каждую строку.
	// BSLLS:MagicNumber-off - треть секунды, константа имени не добавит.
	ПодключитьОбработчикОжидания("Подключаемый_ОбновитьСведения", 0.3, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьСведения()

	Если ПанельСвернута Тогда
		Возврат;
	КонецЕсли;
	Ссылка = Элементы.Список.ТекущаяСтрока;
	Если ТипЗнч(Ссылка) <> Тип("СправочникСсылка.Номенклатура") Тогда
		// Нет текущей строки - сведения прежнего товара не остаются в панели.
		ТоварТекст = "";
		ДвижениеТекст = "";
		ОстаткиПоСкладам.Очистить();
		Возврат;
	КонецЕсли;
	ЗаполнитьСведения(Ссылка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СвернутьПанель(Команда)

	ПанельСвернута = Истина;
	ПрименитьСостояниеПанели();

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьПанель(Команда)

	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Подключаемый_ОбновитьСведения();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьФильтры(Команда)

	ОткрытьСтраницуПанели("СтраницаФильтры");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТовар(Команда)

	ОткрытьСтраницуПанели("СтраницаТовар");

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьДвижение(Команда)

	ОткрытьСтраницуПанели("СтраницаДвижение");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свёрнутая панель - столбик значков, развёрнутая - закладки со страницами.
//
&НаКлиенте
Процедура ПрименитьСостояниеПанели()

	Элементы.ГруппаПанельЗначки.Видимость = ПанельСвернута;
	Элементы.ГруппаПодвалПанели.Видимость = Не ПанельСвернута;
	Элементы.ГруппаСтраницыСведений.Видимость = Не ПанельСвернута;

КонецПроцедуры

// Разворачивает панель и активирует страницу по имени.
//
// Параметры:
//  ИмяСтраницы - Строка - имя страницы панели сведений
//
&НаКлиенте
Процедура ОткрытьСтраницуПанели(ИмяСтраницы)

	Свернута = ПанельСвернута;
	ПанельСвернута = Ложь;
	ПрименитьСостояниеПанели();
	Элементы.ГруппаСтраницыСведений.ТекущаяСтраница = Элементы[ИмяСтраницы];
	Если Свернута Тогда
		Подключаемый_ОбновитьСведения();
	КонецЕсли;

КонецПроцедуры

// Контекст открытия, фильтры панели - в параметры запроса и группу «Панель» отбора списка (ОтборыСписков). При
// отборе по реквизитам товара список плоский: папки отбор не проходят.
//
&НаСервере
Процедура ПрименитьОтборы()

	Отборы = ОтборыПанели();
	ПараметрыЗапроса = Справочники.Номенклатура.ПараметрыЗапросаСписка(КонтекстСписка(), Отборы);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Список.Параметры.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	ЕстьОтбор = Справочники.Номенклатура.УстановитьОтборыПанели(Список.Отбор, Отборы);
	Элементы.Список.Отображение = ?(ЕстьОтбор, ОтображениеТаблицы.Список, ОтображениеТаблицы.ИерархическийСписок);

КонецПроцедуры

// Возвращаемое значение:
//  Структура - см. Справочники.Номенклатура.НовыйКонтекстСписка
//
&НаСервере
Функция КонтекстСписка()

	Контекст = Справочники.Номенклатура.НовыйКонтекстСписка();
	Контекст.ТолькоЗакупаемые = Параметры.ТолькоЗакупаемые;
	Контекст.ТолькоПродаваемые = Параметры.ТолькоПродаваемые;
	Контекст.ТолькоТовары = Параметры.ТолькоТовары;
	Если ЗначениеЗаполнено(Параметры.ОтборТипа) Тогда
		Контекст.ОтборТипа = Параметры.ОтборТипа;
	КонецЕсли;
	Возврат Контекст;

КонецФункции

// Фильтры панели из реквизитов формы; позиции тумблеров «Тип» и «Пополнение» - порядок значений перечислений.
//
// Возвращаемое значение:
//  Структура - см. Справочники.Номенклатура.НовыеОтборыПанели
//
&НаСервере
Функция ОтборыПанели()

	Отборы = Справочники.Номенклатура.НовыеОтборыПанели();
	Если ФильтрТип > 0 Тогда
		Отборы.Тип = Перечисления.ТипыНоменклатуры.Получить(ФильтрТип - 1);
	КонецЕсли;
	Если ФильтрПополнение > 0 Тогда
		Отборы.Пополнение = Перечисления.СпособыПополненияЗапасов.Получить(ФильтрПополнение - 1);
	КонецЕсли;
	Отборы.Наличие = ФильтрНаличие;
	Отборы.Склад = ОтборСклад;
	Отборы.ТоварнаяГруппа = ОтборТоварнаяГруппа;
	Отборы.Бренд = ОтборБренд;
	Отборы.ОсновнойПоставщик = ОтборПоставщик;
	Отборы.Качество = ОтборКачество;
	Отборы.ПоказыватьПомеченные = ПоказыватьПомеченные;
	Возврат Отборы;

КонецФункции

// Позиции тумблеров по опциям: без производства - нет продукции, полуфабриката, сырья и фильтра пополнения, без
// комплектации - нет комплекта. Значения опций на клиенте недоступны (tiny1C bsl-009) - только здесь.
//
&НаСервере
Процедура НастроитьФильтры()

	ИспользуетсяПроизводство = ПолучитьФункциональнуюОпцию("Производство");
	Элементы.ФильтрПополнение.Видимость = ИспользуетсяПроизводство;
	Убрать = Новый Массив;
	Если Не ИспользуетсяПроизводство Тогда
		Убрать.Добавить(Перечисления.ТипыНоменклатуры.Продукция);
		Убрать.Добавить(Перечисления.ТипыНоменклатуры.Полуфабрикат);
		Убрать.Добавить(Перечисления.ТипыНоменклатуры.Сырье);
	КонецЕсли;
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьКомплектацию") Тогда
		Убрать.Добавить(Перечисления.ТипыНоменклатуры.Комплект);
	КонецЕсли;
	СписокТипов = Элементы.ФильтрТип.СписокВыбора;
	Для Каждого Тип Из Убрать Цикл
		Позиция = СписокТипов.НайтиПоЗначению(Перечисления.ТипыНоменклатуры.Индекс(Тип) + 1);
		Если Позиция <> Неопределено Тогда
			СписокТипов.Удалить(Позиция);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// Сохранённая позиция, которой больше нет в тумблере (опцию выключили), сбрасывается на «Все».
//
&НаСервере
Процедура СброситьНедоступныеПозиции()

	Если Элементы.ФильтрТип.СписокВыбора.НайтиПоЗначению(ФильтрТип) = Неопределено Тогда
		ФильтрТип = 0;
	КонецЕсли;
	Если Не Элементы.ФильтрПополнение.Видимость Тогда
		ФильтрПополнение = 0;
	КонецЕсли;

КонецПроцедуры

// Сведения о текущем товаре для закладок «Товар» и «Движение».
//
// Параметры:
//  Ссылка - СправочникСсылка.Номенклатура - текущая строка списка
//
&НаСервере
Процедура ЗаполнитьСведения(Знач Ссылка)

	Сведения = Справочники.Номенклатура.СведенияДляПанели(Ссылка);
	ТоварТекст = Сведения.ТоварТекст;
	ДвижениеТекст = Сведения.ДвижениеТекст;
	ОстаткиПоСкладам.Загрузить(Сведения.Остатки);

КонецПроцедуры

// Команды разделов открывают список с параметром: «Закупаемые товары», «Товары», «Товары и услуги для продажи»,
// «Сырьё», «Полуфабрикаты», «Готовая продукция» - заголовок по нему. Отбор состава - в ПараметрыЗапросаСписка.
//
&НаСервере
Процедура УстановитьЗаголовок()

	Если Параметры.ТолькоЗакупаемые Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Закупаемые товары'; fr = 'Articles achetés'; en = 'Purchased items'; es = 'Artículos comprados'");
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ОтборТипа) Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = ЗаголовокПоТипу(Параметры.ОтборТипа);
	КонецЕсли;
	Если Параметры.ТолькоТовары Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Товары'; fr = 'Marchandises'; en = 'Goods'; es = 'Mercancías'");
	КонецЕсли;
	Если Параметры.ТолькоПродаваемые Тогда
		АвтоЗаголовок = Ложь;
		Заголовок = НСтр("ru = 'Товары и услуги для продажи'; fr = 'Articles vendus'; en = 'Items for sale';
			|es = 'Artículos para la venta'");
	КонецЕсли;

КонецПроцедуры

// Параметры:
//  Тип - ПеречислениеСсылка.ТипыНоменклатуры - тип из параметра ОтборТипа
//
// Возвращаемое значение:
//  Строка - заголовок формы
//
&НаСервереБезКонтекста
Функция ЗаголовокПоТипу(Тип)

	Если Тип = Перечисления.ТипыНоменклатуры.Сырье Тогда
		Возврат НСтр("ru = 'Сырье'; fr = 'Matières premières'; en = 'Raw materials'; es = 'Materias primas'");
	ИначеЕсли Тип = Перечисления.ТипыНоменклатуры.Полуфабрикат Тогда
		Возврат НСтр("ru = 'Полуфабрикаты'; fr = 'Produits semi-finis'; en = 'Semi-finished products';
			|es = 'Productos semielaborados'");
	ИначеЕсли Тип = Перечисления.ТипыНоменклатуры.Продукция Тогда
		Возврат НСтр("ru = 'Готовая продукция'; fr = 'Produits finis'; en = 'Finished products'; es = 'Productos terminados'");
	Иначе
		Возврат Строка(Тип);
	КонецЕсли;

КонецФункции

// Кассир (роль PDV) не видит коды поставщика и производителя, основного поставщика и старый код даже через
// «Изменить форму»: программная видимость перекрывает пользовательскую.
//
&НаСервере
Процедура НастроитьФорму()

	// Роль кассира, а не право на объект: скрываются реквизиты, читать которые он вправе.
	// BSLLS:IsInRoleMethod-off
	Если Не РольДоступна("PDV") Тогда
		Возврат;
	КонецЕсли;
	// BSLLS:IsInRoleMethod-on
	Для Каждого Имя Из СтрРазделить("КодПоставщика,КодПроизводителя,ОсновнойПоставщик,КодСтарый,ЦенаЗакупки", ",") Цикл
		Элементы[Имя].Видимость = Ложь;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
